let a = +prompt('Player 1 : ใส่เลขจำนวนเต็มระหว่าง 1-100 เพื่อให้ผู้เล่นอีกคนทาย(Player 2)');

 
if ( a >=  1 && a <=100 && a%1 === 0) {

    let b = +prompt ('Player 2 : กรุณาทายเลขให้ถูกต้อง');
while (b !== a) {

    if (b>a && b%1 === 0  && b <= 100) {
        alert('ค่าที่คุณทายมากเกินไป ลองทายเลขที่น้อยลงกว่านี้นะ');
        b = +prompt ('Player 2 : ทายให้น้อยลงกว่าเดิม ^^');
    }
    else if(b<a && b%1 === 0 && b <= 100 ) {
        alert('ค่าที่คุณทายน้อยเกินไป ลองทายเลขที่มากกว่านี้ดู');
         b = +prompt ('Player 2 : ทายให้มากขึ้นกว่าเดิม ^^');
    }

    else if (b%1 !== 0 ) {
        alert('ทายเป็นจำนวนเต็มสิครับ');
         b = +prompt ('Player 2 : ใส่เลขที่ไม่เป็นทศนิยม');
    }

    else if ( b < 1 || b > 100 ) {
    
        alert('ใส่เลขในช่วง 1-100 นะ ');
         b = +prompt ('Player 2 : เลขอะไรก็ได้ในช่วง 1-100 และไม่มีทศนิยม');
    }
    
    else if (b===a) {
   
    break;
}
}

alert (`ถูกต้องนะคร้าบบบบบบบบบบบบบ คำตอบที่ถูกต้องคือ  ${a}`);

    
}

else if (  a >=  1 && a <=100 && a%1 !== 0 ){
    alert('กรุณาใส่เลขที่เป็นจำนวนเต็มเท่านั้น! อย่างแกล้งคนอื่นสิ');
}

else if ( a < 1 || a > 100 ) {
    
    alert('กรุณาใส่เลขที่อยู่ในช่วง 1-100');
}










