// การตั้งชื่ออตัวแปรแบบไหน ถูกต้องหรือไม่ถูกต้อง


let c4mp = 1 ;        // ถูกต้อง 
let codecamp45 = 2 ; // ถูกต้อง 
let _ = 3 ;            // ถูกต้อง 
let $code =4 ;        // ถูกต้อง 
let 5codecamp =5 ;   // ผิด เพราะขึ้นด้วยตัวเลข
let codecamp#5 =6;  // ผิด เพราะมีสัญลักษณ์ # (ไม่ใช่ $ กับ _)
let code camp =7;   // ผิดเพราะเว้นวรรค
let function1 =8 ;   // ถูกต้อง
let function = 9;     // ผิดเพราะเป็นคำสงวน
let  if = 10;          // ผิดเพราะเป็นคำสงวน
let _if = 11;          // ถูกต้อง 
let else = 12;         // ผิดเพราะเป็นคำสงวน
let codecamp-5 = 13;   // ผิด เพราะมีสัญลักษณ์ - (ไม่ใช่ $ กับ _)
let โค๊ดแคมป์5 =14;   // ไม่ผิด แต่ไม่ควรตั้งเป็นภาษาไทย
